Week 6/W6D3/first_routes_and_controllers/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.user_id = User.first.id
    if @user.save
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Joey"], ["email", "joey.a.fern@gmail.com"], ["created_at", "2021-08-11 22:37:51.616311"], ["updated_at", "2021-08-11 22:37:51.616311"]]

  def update
    @user = User.find_by(id: params[:id])
    unless @user
      render json: { error: 'There is no user with that id.' }
      return
    end

    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "anonsense@string.com"], ["updated_at", "2021-08-11 23:38:19.432140"], ["id", 1]]

  def destroy
    @user = User.find_by(id: params[:id])
    if @user
      @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]