Week 6/W6D4/Art Share API Part 1/app/controllers/artwork_shares_controller.rb

  def create
    @artwork_share = ArtworkShare.new(artwork_share_params)
    if @artwork_share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 1], ["viewer_id", 6], ["created_at", "2021-08-12 21:41:50.232940"], ["updated_at", "2021-08-12 21:41:50.232940"]]