Week 6/W6D4/Art Share API Part 1/app/controllers/comments_controller.rb

  def index
    # @artworks = Artwork.all
    # render json: @artworks
    # debugger
    if params[:user_id]
      @comments = Comment.where(user_id: params[:user_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]