Week 11/W11D2/Todos Phase 3/app/controllers/api/todos_controller.rb

SELECT "todos".* FROM "todos"
---
  def index
    todos = Todo.all